---
kind: property
id: P:Autodesk.Revit.DB.Macros.Macro.Description
source: html/ee35d0c0-b226-45f0-d551-186ac1ae551f.htm
---
# Autodesk.Revit.DB.Macros.Macro.Description Property

The macro description.

## Syntax (C#)
```csharp
public string Description { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null